{
  "name": "Игнатов Сергей Николаевич",
  "address": "Владивосток, Россия",
  "email": "cenergiy408@gmail.com",
  "telegram_address": "@dmitry_120804",
  "about me": [
    "Старший Frontend Engineer с более чем 20-летним опытом разработки цифровых решений для бизнеса. Специализируюсь на создании и трансформации корпоративных порталов и веб-приложений, интеграции с внешними системами и повышении стабильности сложных решений. Обладаю глубокими знаниями архитектуры 1С-Битрикс, PHP 8 и Git, умею находить креативные решения в условиях неопределённости. В предыдущих проектах успешно реализовывал новые модули и интеграции, оптимизировал работу систем и повышал надежность сервисов. Могу быстро усилить команду и взять ответственность за результат проекта."
  ],
  "work experience": [
    {
      "company name": "Smarter Holdings International Ltd",
      "role": "Senior Frontend Engineer",
      "period": "Июнь 2021 – Ноябрь 2025",
      "experience": [
        "Разрабатывал и поддерживал сложные веб-интерфейсы с интеграцией внутренних сервисов.",
        "Создавал новые функциональные модули, расширяя возможности существующих приложений.",
        "Реализовывал асинхронные взаимодействия и интеграции с внешними API.",
        "Анализировал проблемные зоны и находил нестандартные решения для стабилизации систем.",
        "Поддерживал стабильность приложений при обновлениях и изменениях требований.",
        "Внедрял процессы логирования и мониторинга для своевременного устранения ошибок.",
        "Сотрудничал с backend-разработчиками для согласования контрактов API.",
        "Использовал Git для контроля версий и организации код-ревью в команде."
      ]
    },
    {
      "company name": "ООО «Диасофт»",
      "role": "Senior Full-Stack Developer",
      "period": "Октябрь 2016 – Февраль 2021",
      "experience": [
        "Разрабатывал внутренние корпоративные порталы и бизнес-системы на PHP и 1С-Битрикс.",
        "Создавал модули для автоматизации ключевых процессов компании.",
        "Настраивал интеграцию с внешними сервисами и CRM-системами.",
        "Оптимизировал код и архитектуру приложений для повышения стабильности.",
        "Участвовал в планировании задач и выборе оптимальных решений для разработки.",
        "Внедрял систему контроля версий Git и организовывал совместную работу команды.",
        "Поддерживал работоспособность порталов при высокой нагрузке и обновлениях.",
        "Разрабатывал тестовые сценарии и проводил интеграционное тестирование."
      ]
    },
    {
      "company name": "INSIDE 360",
      "role": "Web / Full-Stack Developer",
      "period": "Январь 2011 – Август 2016",
      "experience": [
        "Создавал веб-приложения с богатым пользовательским интерфейсом и интеграциями.",
        "Разрабатывал серверную логику и модули на PHP, обеспечивая согласованную работу компонентов.",
        "Оптимизировал производительность приложений и повышал стабильность работы систем.",
        "Настраивал интеграцию с внешними сервисами и внутренними системами.",
        "Внедрял новые интерфейсы и улучшал UX для корпоративных порталов.",
        "Решал нестандартные задачи в условиях ограниченной информации и ресурсов.",
        "Поддерживал рабочие приложения на продакшене, оперативно устраняя ошибки.",
        "Применял гибкость и креативность при реализации сложных требований заказчиков."
      ]
    },
    {
      "company name": "LandingDV",
      "role": "Software Developer",
      "period": "Февраль 2003 – Август 2010",
      "experience": [
        "Разрабатывал прикладные решения для малого и среднего бизнеса на PHP.",
        "Самостоятельно проектировал и внедрял новые функциональные возможности.",
        "Настраивал интеграции с внешними системами и платёжными сервисами.",
        "Обеспечивал стабильность и безопасность приложений при ограниченных ресурсах.",
        "Использовал эмоциональный интеллект для общения с клиентами и командой.",
        "Трансформировал устаревшие системы в более устойчивые и масштабируемые продукты.",
        "Реализовывал решения с учетом долгосрочной поддержки и развития.",
        "Разрабатывал документацию и стандарты кодирования для команды."
      ]
    }
  ],
  "education": [
    {
      "institution": "Саратовский государственный технический университет",
      "period": "1997 - 2002",
      "degree": "Специалитет: инженер по прикладной информатике"
    }
  ],
  "skills": [
    "PHP 7–8, разработка на 1С-Битрикс (БУС и корпоративный портал)",
    "Проектирование и реализация модулей и интеграций с внешними сервисами",
    "HTML, CSS, JavaScript (React, Vue.js) для фронтенд интеграций",
    "Работа с Git, настройка процессов контроля версий",
    "Оптимизация и поддержка корпоративных решений, логирование и устранение ошибок",
    "Разработка архитектуры и модульная декомпозиция приложений",
    "REST, SOAP, асинхронные взаимодействия, очереди сообщений",
    "Docker, базовые навыки CI/CD, мониторинг производительности"
  ],
  "cover letter": [
    "Круизный центр «Инфофлот»",
    "Здравствуйте.",
    "Я думаю, ваша команда сталкивается с задачей масштабного развития корпоративного портала и интеграции с системой бронирования, которая требует надежного и гибкого решения.",
    "Я предлагаю свой опыт разработки на PHP 8 и 1С-Битрикс (БУС и корпоративный портал) для реализации новых модулей и интеграций, обеспечивая стабильность и расширение функционала.",
    "В течение более чем 20 лет я реализовывал и трансформировал корпоративные решения, создавал новые модули, настраивал интеграции с внешними сервисами и обеспечивал стабильность работы порталов. В последних проектах я тесно работал с Git, разрабатывал и поддерживал сложные бизнес-системы, улучшал производительность и устранял ошибки. Такой подход позволяет мне быстро подключиться к развитию вашего портала и сделать интеграцию с бронированием надежной и предсказуемой.",
    "Буду рад обсудить, как мои навыки могут усилить команду «Инфофлота» и помочь в реализации ваших задач. Готов перейти к следующему этапу обсуждения и техническому интервью.",
    "С уважением, Сергей Игнатов"
  ]
}